tap "hashicorp/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "imxieyi/waifu2x"

# ============================================
# 開発ツール（基本）
# ============================================

brew "git"
brew "neovim"
brew "zsh"

# 検索・ファイル操作（Neovim依存）
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"

# ============================================
# 言語環境・ランタイム
# ============================================

# Python
brew "pyenv"

# Node.js
brew "fnm"

# ============================================
# インフラ・DevOps
# ============================================

# AWS
brew "awscli"

# コンテナ
brew "colima"
brew "docker"

# Infrastructure as Code
brew "hashicorp/tap/terraform"

# ============================================
# ユーティリティ
# ============================================

# JSON/YAML処理
brew "jq"
brew "yq"

# ファイル同期
brew "syncthing", restart_service: :changed

# github cli
brew "gh"

# ネットワーク
brew "wget"
brew "mole"

# システム監視
brew "mactop"

# その他
brew "mas"
brew "watch"
brew "cask"

# ============================================
# メディア処理
# ============================================

# 動画
brew "yt-dlp"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]

# 画像
brew "imagemagick"
brew "imxieyi/waifu2x/waifu2x"

# ============================================
# GUI アプリケーション
# ============================================

# ターミナル
cask "ghostty@tip"

# ブラウザ
cask "google-chrome"

# PKM
cask "obsidian"
cask "anki"

# ユーティリティ
cask "raycast"
cask "the-unarchiver"
cask "karabiner-elements"
cask "scroll-reverser"
cask "jordanbaird-ice"
cask "appcleaner"

# AI 
cask "claude"

# メディア
cask "iina"
cask "blu-ray-player"

# フォント
cask "font-hackgen-nerd"

# 音楽制作
cask "native-access"

# コミュニケーション
cask "discord"
cask "slack"

# クリエイティブ
cask "blender"
cask "affinity"

# その他
cask "localsend"
cask "raspberry-pi-imager"
cask "spotify"

# ============================================
# Mac App Store
# ============================================

# ユーティリティ
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "RunCat", id: 1429033973

# コミュニケーション
mas "LINE", id: 539883307

# クリエイティブ
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523

# リモート
mas "Windows App", id: 1295203466

# その他
mas "Simple Metronome", id: 1604183938
mas "Shazam", id: 897118787
